## Tratamiento de Variables Categoricas

In [45]:
import pandas as pd
import numpy as np
import os
from sklearn.linear_model import LinearRegression

In [31]:
mainpath="/Volumes/Developer/Study/Udemy/Machine Learning/python-ml-course/datasets"
filename="ecom-expense/Ecom Expense.csv"
fullpath= os.path.join(mainpath, filename)

In [32]:
df = pd.read_csv(fullpath)

In [33]:
df.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485

In [34]:
dummy_gender = pd.get_dummies(df['Gender'], prefix='Gender')
dummy_city_tier = pd.get_dummies(df['City Tier'], prefix="City")

In [35]:
dummy_gender.head()

   Gender_Female  Gender_Male
0              1            0
1              1            0
2              0            1
3              1            0
4              1            0

In [36]:
dummy_city_tier.head()

   City_Tier 1  City_Tier 2  City_Tier 3
0            1            0            0
1            0            1            0
2            0            1            0
3            1            0            0
4            0            1            0

In [37]:
column_names = df.columns.values.tolist()
column_names

['Transaction ID',
 'Age ',
 ' Items ',
 'Monthly Income',
 'Transaction Time',
 'Record',
 'Gender',
 'City Tier',
 'Total Spend']

In [38]:
# #Elimino los espacios
# for i in range(len(column_names)):
#     column_names[i]= column_names[i].strip()

# column_names

In [39]:
df_new = df[column_names].join(dummy_gender)
column_names = df_new.columns.values.tolist()
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0

In [41]:
df_new = df_new[column_names].join(dummy_city_tier)
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0

In [85]:
feature_cols = [ "Transaction Time","Monthly Income", "Gender_Female", "Gender_Male", 
                "City_Tier 1", "City_Tier 2", "City_Tier 3","Record"]

In [86]:
X = df_new[feature_cols]
Y = df_new["Total Spend"]

In [87]:
lm = LinearRegression()
lm.fit(X, Y)

LinearRegression()

In [88]:
print(lm.intercept_)
print(lm.coef_)

-79.41713029853963
[ 1.54946125e-01  1.47538980e-01 -1.31025013e+02  1.31025013e+02
  7.67643260e+01  5.51389743e+01 -1.31903300e+02  7.72233446e+02]

In [89]:
list(zip(feature_cols, lm.coef_))

[('Transaction Time', 0.1549461254904773),
 ('Monthly Income', 0.14753898049204883),
 ('Gender_Female', -131.02501325554564),
 ('Gender_Male', 131.02501325554582),
 ('City_Tier 1', 76.76432601049534),
 ('City_Tier 2', 55.138974309232424),
 ('City_Tier 3', -131.90330031972783),
 ('Record', 772.2334457445642)]

In [90]:
lm.score(X,Y)

0.9179923586131016

In [136]:
"""Escribiendola manual"""
# df_new['predict'] = -79.41713029853963 + df_new['Transaction Time']*0.1549461254904773+ df_new['Monthly Income']*0.14753898049204883+ df_new['Gender_Female']*(-131.02501325554564)+ df_new['Gender_Male']*(131.02501325554582)+ df_new['City_Tier 1']*76.76432601049534+ df_new['City_Tier 2']*55.138974309232424+ df_new['City_Tier 3']*(-131.90330031972783)+ df_new['Record']*772.2334457445642

"""Utilizando la formula"""
df_new['predict'] = lm.predict(df_new[feature_cols])

In [137]:
df_new.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend,Gender_Female,Gender_Male,City_Tier 1,City_Tier 2,City_Tier 3,predict
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084,1,0,1,0,0,4903.696720
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648,1,0,0,1,0,4799.434826
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455,0,1,0,1,0,5157.082504
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676,1,0,1,0,0,8068.012996
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485,1,0,0,1,0,3581.980335

In [138]:
SSD = np.sum((df_new['predict']-df_new['Total Spend'])**2)
SSD

1517733985.3408165

In [139]:
RSE= np.sqrt( SSD / (len(df_new)+len(feature_cols)-1))
RSE

800.4151480183347

In [140]:
sales_mean = np.mean(df_new["Total Spend"])
sales_mean

6163.176415976714

In [141]:
error= RSE/sales_mean
error

0.12987055602423286